rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/pins/Esp32DriverPinsImpl.c
/*******************************************************************************
 * platforms/esp32/source/esp32/driver/pins/Esp32DriverPinsImpl.c
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026 Roku Inc. All rights reserved.
 ******************************************************************************/

#include <lt/core/LTCore.h>
#include <lt/core/LTStdlib.h>
#include <lt/core/LTThread.h>
#include <lt/device/config/LTDeviceConfig.h>
#include <lt/device/pins/LTDevicePins.h>
#include <lt/device/watchdog/LTDeviceWatchdog.h>

#include "Esp32_GPIO.h"
#include "Esp32_Clock.h"
#include "Esp32_Registers.h"

DEFINE_LTLOG_SECTION("esp32.drv.pins");

/* =========================================================================
 * Optional XCLK generation via LEDC high-speed timer 0 / channel 0.
 *
 * Enabled by adding "xclk-gpio" and optionally "xclk-freq-hz" to the
 * Esp32DriverPins driver section in LTDeviceConfig.json, e.g.:
 *
 *   { "lib": "LTDevicePins", "driver": [ { "lib": "Esp32DriverPins",
 *       "xclk-gpio": 0, "xclk-freq-hz": 16000000,
 *       "units": [ ... ] } ] }
 *
 * LEDC HS timer 0 / channel 0 is dedicated to XCLK.  The output is routed
 * through the GPIO matrix (signal LEDC_HS_SIG_OUT0_IDX = 71) to the
 * configured GPIO pin.
 *
 * LEDC frequency formula:
 *   f_out = f_apb / (clock_divider/256) / (2^duty_resolution)
 * With duty_resolution=2 (4-count period) and 50% duty (count=2):
 *   clock_divider = f_apb * 256 / (f_out * 4)
 * ========================================================================= */

#define XCLK_LEDC_SIG_OUT0      71u   /* LEDC_HS_SIG_OUT0_IDX in gpio_sig_map.h */
#define XCLK_DUTY_RES            2u   /* 2-bit → 4-count period */
#define XCLK_APB_HZ     80000000UL
#define XCLK_GPIO_NONE        0xFFu

static u8  s_xclkGpio  = XCLK_GPIO_NONE;
static u32 s_xclkFreqHz = 0u;

static void XclkStart(void) {
    if (s_xclkGpio == XCLK_GPIO_NONE) return;

    u32 freq = s_xclkFreqHz ? s_xclkFreqHz : 16000000u;
    u32 divider = (u32)(((u64)XCLK_APB_HZ * 256UL) / ((u64)freq * (1u << XCLK_DUTY_RES)));
    if (!divider) divider = 1u;

    Esp32_ClockEnablePeripheralClock(kEsp32_Clock_LEDC);

    ESP32_LEDC_TIMER_REG(CONF, 0) = kEsp32_RegisterLEDC_HSTIMER_CONF_RST_M;
    ESP32_LEDC_TIMER_REG(CONF, 0) =
        (XCLK_DUTY_RES << kEsp32_RegisterLEDC_HSTIMER_CONF_DUTY_RES_S)
      | (divider       << kEsp32_RegisterLEDC_HSTIMER_CONF_CLK_DIV_NUM_S)
      | kEsp32_RegisterLEDC_HSTIMER_CONF_TICK_SEL_APB_M;

    ESP32_LEDC_CHANNEL_REG(HPOINT, 0) = 0u;
    ESP32_LEDC_CHANNEL_REG(DUTY,   0) = (1u << XCLK_DUTY_RES) / 2u << 4u;  /* 50%, 4 frac bits */
    ESP32_LEDC_CHANNEL_REG(CONF0,  0) = kEsp32_RegisterLEDC_HSCH_CONF0_OUT_EN_M;
    ESP32_LEDC_CHANNEL_REG(CONF1,  0) = kEsp32_RegisterLEDC_HSCH_CONF1_DUTY_START_M;

    Esp32GPIO_ConfigPin(s_xclkGpio, kEsp32GPIO_Direction_Input,
                        kEsp32GPIO_PullNone, kEsp32GPIO_Function_GPIO);
    Esp32GPIO_ConfigMatrixPin(s_xclkGpio, XCLK_LEDC_SIG_OUT0,
                              kEsp32GPIO_Direction_Output, false);

    LTLOG_DEBUG("xclk", "XCLK %luHz on GPIO%lu (div=%lu)",
        LT_Pu32(freq), LT_Pu32((u32)s_xclkGpio), LT_Pu32(divider));
}

static void XclkStop(void) {
    if (s_xclkGpio == XCLK_GPIO_NONE) return;
    Esp32GPIO_ClearPinConfig(s_xclkGpio);
    ESP32_LEDC_CHANNEL_REG(CONF0, 0) = 0u;
    ESP32_LEDC_TIMER_REG(CONF,   0) = kEsp32_RegisterLEDC_HSTIMER_CONF_RST_M;
    Esp32_ClockDisablePeripheralClock(kEsp32_Clock_LEDC);
}

#define LTDEVICEPINS_DO_DLOG     0
#if     LTDEVICEPINS_DO_DLOG
#define DLOG                    LTLOG
#else
#define DLOG                    LTLOG_LOGNULL
#endif

#define REBOOT_THREAD_STACKSIZE 768

/* clang-format off */

enum { kInputOnlyHereAndUp = 33 };  /* All GPIO this and later are input-only. */

enum { kReservedPins =   (1 << 1)  /* UART             */
                       | (1 << 3)  /* UART             */
                       | (1 << 6)  /* SPI flash        */
                       | (1 << 7)  /* SPI flash        */
                       | (1 << 8)  /* SPI flash        */
                       | (1 << 9)  /* SPI flash        */
                       | (1 << 10) /* SPI flash        */
                       | (1 << 11) /* SPI flash        */
                       | (1 << 28) /* not configurable */
                       | (1 << 29) /* not configurable */
                       | (1 << 30) /* not configurable */
                       | (1 << 31) /* not configurable */ };

/* Return nonzero if pin nPin is in the reserved list (above): */
static bool IsPinReserved(u32 nPin) { return nPin > 31 ? false : 1 << nPin & kReservedPins; }

static LTDeviceWatchdog *s_pWatchdog = NULL;

/* A thread is required to wait for a reboot, and then to force such configured pins to hold
 * the value through a reboot. */
static ILTThread *s_iThread       = NULL;
static LTThread   s_hRebootThread = 0;

/* ISR Callback support */
typedef struct {
    LTDevicePin_IRQCallback *pCallback;
    void                    *pClientData;
} IRQ;

LT_STATIC_ASSERT_SIZE_32_64(IRQ, 8, 16);

/* A GPIO Pin instance (Device Unit), generated in LibInit, one for each pin called out in the DeviceConfig: */
typedef struct {
    const char  *pName;         /* Name, given in the "name" element in the DeviceConfig
                                   NOTE: LTDeviceConfig must remain open for the data
                                         dereferenced by this pointer to remain valid.      */
    IRQ          irq;           /* Callback and client data passed thereto                  */
    LTInterface *pInterface;    /* Which interface to supply (through gethandleinterface()) */
    LTMutex     *mutex;         /* mutual exclusion for reference counting and IRQ          */
    u32          nRefCount;     /* how many clients have a handle to this instance          */
    u8           nPin;          /* the GPIO pin in question                                 */
    bool         bRebootHold;   /* if the pin level is kept through a reboot                */
} PinInstance;

LT_STATIC_ASSERT_SIZE_32_64(PinInstance, 28, 48);

/* Container for all the pin instances */
typedef struct DeviceUnits {
    PinInstance *pDeviceUnits;      /* Pointer into the heap where the Device Units are stored (as an array) */
    u32          nNumDeviceUnits;   /* How many Device Units this Driver supplies                            */
} DeviceUnits;

LT_STATIC_ASSERT_SIZE_32_64(DeviceUnits, 8, 12);

