rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/pins/Esp32DriverPinsImpl.c
static DeviceUnits s_DeviceUnits;

/* Return a pointer to the Device Unit instance, given the Device Unit handle: */
static PinInstance *InstanceFromHandle(LTDeviceUnit hPin) {
    if (!hPin) return NULL;
    PinInstance **ppInstance = (PinInstance **)LT_GetCore()->ReserveHandlePrivateData(hPin);
    PinInstance *pInstance = NULL;
    if (ppInstance) {
        pInstance = *ppInstance;
        LT_GetCore()->ReleaseHandlePrivateData(hPin, ppInstance);
    }
    return pInstance;
}

/* Interrupt service routine for all GPIO pins associated with this Driver */
static void Esp32DriverPinsImpl_ISR(u8 nPin, bool bPinHigh, void *pClientData) { LT_UNUSED(nPin);
    IRQ *pIRQ = &((PinInstance *)pClientData)->irq;
    if (pIRQ->pCallback) pIRQ->pCallback(bPinHigh, pIRQ->pClientData);
}

/* Return ESP32 pull type given generic pull type: */
static Esp32GPIO_PullType LTPull_To_Esp32Pull(LTDevicePin_PinConfiguration_PullType pullType) {
    Esp32GPIO_PullType esp32PullType = kEsp32GPIO_PullNone;
    switch (pullType) {
    case kLTDevicePin_PinConfiguration_PullType_PullUp:   esp32PullType = kEsp32GPIO_PullUp;      break;
    case kLTDevicePin_PinConfiguration_PullType_PullDown: esp32PullType = kEsp32GPIO_PullDown;    break;
    case kLTDevicePin_PinConfiguration_PullType_NoPull:   esp32PullType = kEsp32GPIO_PullNone;    break;
    }
    return esp32PullType;
}

/* ESP32 does not support the concept of pin banks; one pin per bank: */
static u32 Esp32DriverPinsImpl_GetNumPins(LTDeviceUnit hPin) { LT_UNUSED(hPin); return 1; }

/* Read a GPIO pin.  Return 1 for high, 0 for low, LT_U32_MAX for an invalid handle: */
static u32 Esp32DriverPinsImpl_Read(LTDeviceUnit hPin) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    return pInstance ? Esp32GPIO_ReadPin(pInstance->nPin) : LT_U32_MAX;
}

/* Set and clear the ISR callback and client data: */
static void SetIRQ(PinInstance *pInstance, LTDevicePin_IRQCallback *pCallback, void *pClientData) {
    pInstance->irq.pCallback   = pCallback;
    pInstance->irq.pClientData = pClientData;
}

static void ClearIRQ(PinInstance *pInstance) { SetIRQ(pInstance, NULL, NULL); }

/* Enable an interrupt for a given Device Unit: */
static void Esp32DriverPinsImpl_EnableIRQ(LTDeviceUnit hPin, LTDevicePin_PinConfiguration_Trigger trigger,
                                            LTTime tmDebounce, LTDevicePin_IRQCallback *pISRCallback, void *pISRClientData) {
    LT_UNUSED(tmDebounce); // ESP32 does not support debounce
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) {
        Esp32GPIO_Trigger triggerEdge = kEsp32GPIO_Trigger_Disabled;
        switch (trigger) {
        case kLTDevicePin_PinConfiguration_Trigger_RisingEdge:  triggerEdge = kEsp32GPIO_Trigger_Rising;    break;
        case kLTDevicePin_PinConfiguration_Trigger_FallingEdge: triggerEdge = kEsp32GPIO_Trigger_Falling;   break;
        case kLTDevicePin_PinConfiguration_Trigger_BothEdges:   triggerEdge = kEsp32GPIO_Trigger_Both;      break;
        case kLTDevicePin_PinConfiguration_Trigger_LowLevel:    triggerEdge = kEsp32GPIO_Trigger_LowLevel;  break;
        case kLTDevicePin_PinConfiguration_Trigger_HighLevel:   triggerEdge = kEsp32GPIO_Trigger_HighLevel; break;
        }
        pInstance->mutex->API->Lock(pInstance->mutex);
        SetIRQ(pInstance, pISRCallback, pISRClientData);
        if (!Esp32GPIO_AttachISR(pInstance->nPin, triggerEdge, Esp32DriverPinsImpl_ISR, pInstance)) ClearIRQ(pInstance);
        pInstance->mutex->API->Unlock(pInstance->mutex);
    }
}

/* Disable an interrupt for a given PinInstance: */
static void DisableInstanceIRQ(PinInstance *pInstance) {
    if (pInstance) {
        pInstance->mutex->API->Lock(pInstance->mutex);
        Esp32GPIO_DetachISR(pInstance->nPin);
        ClearIRQ(pInstance);
        pInstance->mutex->API->Unlock(pInstance->mutex);
    }
}

/* Disable an interrupt for a given Device Unit: */
static void Esp32DriverPinsImpl_DisableIRQ(LTDeviceUnit hPin) { DisableInstanceIRQ(InstanceFromHandle(hPin)); }

/* Handle destruction (used by all ILTDriverPins interfaces): */
static void OnDestroyHandle(LTHandle hDevice) {
    PinInstance *pInstance = InstanceFromHandle(hDevice);
    if (pInstance) {
        u32 nRefCount = LT_U32_MAX;
        pInstance->mutex->API->Lock(pInstance->mutex);
        if (pInstance->nRefCount > 0) nRefCount = --pInstance->nRefCount;
        pInstance->mutex->API->Unlock(pInstance->mutex);
        if (!nRefCount) DisableInstanceIRQ(pInstance);
    }
}

/*******************************************************************************
 * ILTDriverPins_OutputBank                                                   */

static void Esp32DriverOutputPins_ConfigureOutputType(LTDeviceUnit hPin, LTDevicePin_PinConfiguration_OutputType outputType) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) Esp32GPIO_ConfigOutputType(pInstance->nPin,   outputType == kLTDevicePin_PinConfiguration_OutputType_OpenDrain
                                                               ? kEsp32GPIO_OutputType_OpenDrain
                                                               : kEsp32GPIO_OutputType_PushPull);
}

static void Esp32DriverOutputPins_ConfigureRebootHold(LTDeviceUnit hPin, bool bRebootHold) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) pInstance->bRebootHold = bRebootHold;
}

static void Esp32DriverOutputPins_Set(LTDeviceUnit hPin, u32 pinBits) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) Esp32GPIO_WritePin(pInstance->nPin, (pinBits > 0));
}

define_LTLIBRARY_INTERFACE(ILTDriverPins_OutputBank)
    .GetNumPins          = Esp32DriverPinsImpl_GetNumPins,
    .ConfigureOutputType = Esp32DriverOutputPins_ConfigureOutputType,
    .ConfigureRebootHold = Esp32DriverOutputPins_ConfigureRebootHold,
    .Set                 = Esp32DriverOutputPins_Set,
    .Read                = Esp32DriverPinsImpl_Read
LTLIBRARY_DEFINITION;

/*******************************************************************************
 * ILTDriverPins_BidirectionalBank                                            */

static void Esp32DriverBidirectionalPins_ConfigureAsInput(LTDeviceUnit hPin, LTDevicePin_PinConfiguration_PullType pullType) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) Esp32GPIO_ConfigPin(pInstance->nPin, kEsp32GPIO_Direction_Input, LTPull_To_Esp32Pull(pullType), kEsp32GPIO_Function_GPIO);
}

static void Esp32DriverBidirectionalPins_ConfigureAsOutput(LTDeviceUnit hPin, LTDevicePin_PinConfiguration_OutputType outputType) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) {
        Esp32GPIO_ConfigPin(pInstance->nPin, kEsp32GPIO_Direction_Output, kEsp32GPIO_PullNone, kEsp32GPIO_Function_GPIO);
        Esp32DriverOutputPins_ConfigureOutputType(hPin, outputType);
    }
}

