rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/pins/Esp32DriverPinsImpl.c
define_LTLIBRARY_INTERFACE(ILTDriverPins_BidirectionalBank, OnDestroyHandle)
    .GetNumPins          = Esp32DriverPinsImpl_GetNumPins,
    .ConfigureAsOutput   = Esp32DriverBidirectionalPins_ConfigureAsOutput,
    .ConfigureAsInput    = Esp32DriverBidirectionalPins_ConfigureAsInput,
    .ConfigureRebootHold = Esp32DriverOutputPins_ConfigureRebootHold,
    .Set                 = Esp32DriverOutputPins_Set,
    .Read                = Esp32DriverPinsImpl_Read,
    .EnableIRQ           = Esp32DriverPinsImpl_EnableIRQ,
    .DisableIRQ          = Esp32DriverPinsImpl_DisableIRQ,
LTLIBRARY_DEFINITION;

/*******************************************************************************
 * ILTDriverPins_InputBank                                                    */

static void Esp32DriverInputPins_ConfigurePullType(LTDeviceUnit hPin, LTDevicePin_PinConfiguration_PullType pullType) {
    PinInstance *pInstance = InstanceFromHandle(hPin);
    if (pInstance) Esp32GPIO_ConfigPin(pInstance->nPin, kEsp32GPIO_Direction_Input, LTPull_To_Esp32Pull(pullType), kEsp32GPIO_Function_GPIO);
}

define_LTLIBRARY_INTERFACE(ILTDriverPins_InputBank, OnDestroyHandle)
    .GetNumPins          = Esp32DriverPinsImpl_GetNumPins,
    .ConfigurePullType   = Esp32DriverInputPins_ConfigurePullType,
    .Read                = Esp32DriverPinsImpl_Read,
    .EnableIRQ           = Esp32DriverPinsImpl_EnableIRQ,
    .DisableIRQ          = Esp32DriverPinsImpl_DisableIRQ,
LTLIBRARY_DEFINITION;


/*******************************************************************************
 * ILTDriverPin                                                               */

static u32 Esp32DriverPinsImpl_GetNumDeviceUnits(void) { return s_DeviceUnits.nNumDeviceUnits; }

static LTDeviceUnit Esp32DriverPinsImpl_CreateDeviceUnitHandle(u32 nDeviceUnitIndex) {
    if (nDeviceUnitIndex >= s_DeviceUnits.nNumDeviceUnits) return 0;        /* invalid device unit index */
    PinInstance *pInstance = s_DeviceUnits.pDeviceUnits + nDeviceUnitIndex; /* the PinInstance for the index */
    LTDeviceUnit hDevice = LT_GetCore()->CreateHandle(pInstance->pInterface, sizeof(PinInstance *));
    if (hDevice) {
        PinInstance **ppInstance = (PinInstance **)LT_GetCore()->ReserveHandlePrivateData(hDevice);
        if (ppInstance) {
            *ppInstance = pInstance;    /* assign the PinInstance to the private data */
            pInstance->mutex->API->Lock(pInstance->mutex);
            ++pInstance->nRefCount;
            pInstance->mutex->API->Unlock(pInstance->mutex);
            LT_GetCore()->ReleaseHandlePrivateData(hDevice, ppInstance);
        } else {                        /* invalid private data pointer - throw out the handle */
            LTLOG_YELLOWALERT("cduh.hdl.inv", "Created handle is DOA");
            LT_GetCore()->DestroyHandle(hDevice);
            hDevice = 0;
        }
    } else {
        LTLOG_YELLOWALERT("cduh.create.no", "Unable to create handle");
    }
    return hDevice;
}

/* Pin name lookup support: */
static bool Esp32DriverPinsImpl_GetBankNameFromUnitNumber(u32 nDeviceUnitIndex, char const **ppPinBankNameToSet) {
    if (nDeviceUnitIndex >= s_DeviceUnits.nNumDeviceUnits) return false;
    PinInstance *pInstance = s_DeviceUnits.pDeviceUnits + nDeviceUnitIndex;
    *ppPinBankNameToSet = pInstance->pName;
    return true;
}

static bool Esp32DriverPinsImpl_GetUnitNumberFromBankName(char const *pPinBankName, u32 *pIndexToSet) {
    PinInstance *pInstance = s_DeviceUnits.pDeviceUnits;
    for (u32 n = 0; n < s_DeviceUnits.nNumDeviceUnits; ++n, ++pInstance)
        if (!lt_strcmp(pPinBankName, pInstance->pName)) {
            *pIndexToSet = n;
            return true;
        }
    return false;
}

static bool Esp32DriverPinsImpl_GetBankTypeFromUnitNumber(u32 nDeviceUnitIndex, LTDevicePin_PinType *pPinType) {
    if (nDeviceUnitIndex >= s_DeviceUnits.nNumDeviceUnits) return false;
    PinInstance *pInstance = s_DeviceUnits.pDeviceUnits + nDeviceUnitIndex;
    *pPinType = pInstance->nPin >= kInputOnlyHereAndUp ? kLTDevicePin_PinType_Input : kLTDevicePin_PinType_Bidirectional;
    return true;
}

/*******************************************************************************
 * Device Unit initialization and configuration                               */

/* Data structure containing the entire context for initialization: */
typedef struct Esp32DriverPinsConfigContext {
    LTDeviceConfig       *pDeviceConfig;
    PinInstance          *pNextInstanceToInitialize;       /* pointer to next place in s_DeviceUnits.pDeviceUnits to place a Device Unit instance */
    u32                   driverConfigOffset;              /* The Device Config offset for this Driver */
    u32                   nInitialNumDeviceUnitInstances;  /* number of Device units in the Device Config for this Driver Library */
} Esp32DriverPinsConfigContext;

LT_STATIC_ASSERT_SIZE_32_64(Esp32DriverPinsConfigContext, 16, 24);

/* Reclaim all resources used by the context: */
static Esp32DriverPinsConfigContext *DestroyConfigurationContext(Esp32DriverPinsConfigContext *pContext) {
    if (pContext) {
        lt_closelibrary(pContext->pDeviceConfig);
        lt_free(pContext);
    }
    return NULL;
}

/* Allocate memory for the context, and fill in as much as possible: */
static Esp32DriverPinsConfigContext *CreateConfigurationContext(void) {
    Esp32DriverPinsConfigContext *pContext = lt_malloc(sizeof(Esp32DriverPinsConfigContext));
    if (   !pContext
        || !(pContext->pDeviceConfig                  = lt_openlibrary(LTDeviceConfig))
        || !(pContext->driverConfigOffset             = pContext->pDeviceConfig->GetDriverSection("LTDevicePins", "Esp32DriverPins"))
        || !(pContext->nInitialNumDeviceUnitInstances = pContext->pDeviceConfig->GetNumDeviceUnits(pContext->driverConfigOffset))) return DestroyConfigurationContext(pContext);
    return pContext;
}

/* Configure one Device Unit instance from the configuration information in the Device Config.
   If the Device Unit instance is successfully configured, advance the instance pointer to the next instance,
   and increment the number of available Device Units.  Otherwise, leave the pointer and count alone, and the
   next iteration of the callback will rewrite the current instance (if that happens, ConfigureDeviceUnits()
   reallocs the Device Unit instance array to trim off the unused portion).
   Return true upon success, false if any part of obtaining the configuration information from the Device
   Config fails (this causes the loop iterating on Device Units to terminate early): */
static bool ConfigureDeviceUnit(Esp32DriverPinsConfigContext *pContext, u32 nDeviceUnitIndex) {
    if (s_DeviceUnits.nNumDeviceUnits >= pContext->nInitialNumDeviceUnitInstances) {
        /* All the allocated Device Unit instance storage has already been written.  Ignore any additional configurations: */
        LTLOG_REDALERT("cdu.config.excess", NULL);
        return false;
    }
    PinInstance *pInstance = pContext->pNextInstanceToInitialize;
    u32 deviceUnitSection = pContext->pDeviceConfig->GetDeviceUnitSectionAt(pContext->driverConfigOffset, nDeviceUnitIndex);
    if (!deviceUnitSection) {
        LTLOG_YELLOWALERT("cdu.no", NULL);
        return false;
    }
    if (!(pInstance->pName = pContext->pDeviceConfig->ReadString(deviceUnitSection, "name")) || *pInstance->pName == '\0') {
        LTLOG_YELLOWALERT("cdu.name", NULL);
        return false;
    }
    LTResourceValue gpioValue;
    if (!LT_GetCore()->ReadResourceValue(pContext->pDeviceConfig->GetResourceTree(), deviceUnitSection, "gpio", &gpioValue)) {
        LTLOG_YELLOWALERT("cdu.pin", NULL);
        return false;
    }
    if (gpioValue.type != kLTResourceValueType_Integer) {
        LTLOG_YELLOWALERT("cdu.pin.type", NULL);
        return false;
    }
    if (IsPinReserved((u32)gpioValue.integer)) {
        LTLOG_YELLOWALERT("cdu.pin.reserved", "Pin for \"%s\" (%lu) reserved", pInstance->pName, LT_Pu32((u32)gpioValue.integer));
        return false;
    }
    if (!(pInstance->mutex = lt_createobject(LTMutex))) {
        LTLOG_REDALERT("cdu.mutex", "Unable to allocate mutex for \"%s\"", pInstance->pName);
        return false;
    }
    pInstance->mutex->API->Lock(pInstance->mutex);
    pInstance->pInterface = (pInstance->nPin = (u32)gpioValue.integer) >= kInputOnlyHereAndUp ? (LTInterface *)&s_ILTDriverPins_InputBank
                                                                                              : (LTInterface *)&s_ILTDriverPins_BidirectionalBank;
    ClearIRQ(pInstance);
    pInstance->nRefCount  = 0;
    /* Successfully configured this Device Unit instance.
       Count it and advance to the next place in the Device Unit instance array: */
    ++pContext->pNextInstanceToInitialize;
    ++s_DeviceUnits.nNumDeviceUnits;
    pInstance->mutex->API->Unlock(pInstance->mutex);
    LTLOG_DEBUG("cdu", "pin %u: \"%s\"", pInstance->nPin, pInstance->pName);
    return true;
}

