rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/pins/Esp32DriverPinsImpl.c
static bool ConfigureDeviceUnits(void) {
    if (s_DeviceUnits.nNumDeviceUnits || s_DeviceUnits.pDeviceUnits) return false;   /* already configured - do not allocate and configure again */
    Esp32DriverPinsConfigContext *pContext = CreateConfigurationContext();
    if (!pContext) {
        LTLOG_REDALERT("cdus.context", NULL);
        return false;
    }

    /* Optional XCLK config at the driver level (not per-unit) */
    {
        u32 xclkGpio = pContext->pDeviceConfig->ReadInteger(pContext->driverConfigOffset, "xclk-gpio");
        u32 xclkFreq = pContext->pDeviceConfig->ReadInteger(pContext->driverConfigOffset, "xclk-freq-hz");
        /* ReadInteger returns 0 for absent keys; treat 0 as absent since GPIO0 is
         * a valid pin — caller must always provide xclk-gpio explicitly. */
        s_xclkGpio   = (xclkGpio < 40u) ? (u8)xclkGpio : XCLK_GPIO_NONE;
        s_xclkFreqHz = xclkFreq;
    }
    LT_SIZE nInstanceStorageBytes = pContext->nInitialNumDeviceUnitInstances * sizeof(PinInstance);
    if (!(s_DeviceUnits.pDeviceUnits = pContext->pNextInstanceToInitialize = lt_malloc(nInstanceStorageBytes))) {
        LTLOG_REDALERT("cdus.oom", NULL);
        return DestroyConfigurationContext(pContext);
    }
    lt_memset(s_DeviceUnits.pDeviceUnits, 0, nInstanceStorageBytes);        /* cleanliness is next to godliness */
    for (u32 i = 0; i < pContext->nInitialNumDeviceUnitInstances && ConfigureDeviceUnit(pContext, i); ++i);
    if (!s_DeviceUnits.nNumDeviceUnits || s_DeviceUnits.nNumDeviceUnits > pContext->nInitialNumDeviceUnitInstances) {
        LTLOG_REDALERT("du.n.fault", "expected %lu; actual %lu", LT_Pu32(pContext->nInitialNumDeviceUnitInstances), LT_Pu32(s_DeviceUnits.nNumDeviceUnits));
        return DestroyConfigurationContext(pContext);
    } else if (s_DeviceUnits.nNumDeviceUnits < pContext->nInitialNumDeviceUnitInstances) {
        /* Ended up with fewer Device Units than expected.  Give back some memory and attempt to carry on: */
        LTLOG_YELLOWALERT("du.n.fewer", "expected %lu; actual %lu", LT_Pu32(pContext->nInitialNumDeviceUnitInstances), LT_Pu32(s_DeviceUnits.nNumDeviceUnits));
        lt_realloc(s_DeviceUnits.pDeviceUnits, s_DeviceUnits.nNumDeviceUnits * sizeof(PinInstance));
    } else {
        LTLOG_DEBUG("du.n", "%lu", LT_Pu32(s_DeviceUnits.nNumDeviceUnits));
    }
    DestroyConfigurationContext(pContext);
    return true;
}

/*******************************************************************************
 * Cleanup or bailure
 * Tear down all Device Units and reclaim resources.                          */

static bool Shutdown(Esp32DriverPinsConfigContext *pContext) {
    XclkStop();
    s_xclkGpio   = XCLK_GPIO_NONE;
    s_xclkFreqHz = 0u;
    DestroyConfigurationContext(pContext);
    if (s_DeviceUnits.pDeviceUnits) {
        PinInstance *pInstance = s_DeviceUnits.pDeviceUnits;
        for (u32 i = s_DeviceUnits.nNumDeviceUnits; i; --i, ++pInstance) {
            pInstance->mutex->API->Lock(pInstance->mutex);
            if (pInstance->nRefCount)
                LTLOG_YELLOWALERT("du.nz.ref", "Device Unit still used (nz ref count)");
            pInstance->mutex->API->Unlock(pInstance->mutex);
            DisableInstanceIRQ(pInstance);
            lt_destroyobject(pInstance->mutex);
            pInstance->mutex = NULL;
        }
        lt_free(s_DeviceUnits.pDeviceUnits);
        s_DeviceUnits.pDeviceUnits = NULL;
    }
    s_DeviceUnits.nNumDeviceUnits = 0;

    s_iThread->Destroy(s_hRebootThread);
    s_hRebootThread = 0;
    if (s_pWatchdog) lt_closelibrary(s_pWatchdog);

    return false;
}

/* Set the pin value hold register for the pins that keep their value through reboots. */
void RebootHandler(void *pData) {
    LT_UNUSED(pData);
    if (s_DeviceUnits.pDeviceUnits) {
        PinInstance *pInstance = s_DeviceUnits.pDeviceUnits;
        for (u32 i = s_DeviceUnits.nNumDeviceUnits; i; --i, ++pInstance) {
            pInstance->mutex->API->Lock(pInstance->mutex);
            if (pInstance->bRebootHold
                && (pInstance->pInterface == (LTInterface *)(&s_ILTDriverPins_OutputBank) ||
                pInstance->pInterface == (LTInterface *)(&s_ILTDriverPins_BidirectionalBank))) {
                    Esp32GPIO_ConfigPinHold(pInstance->nPin, pInstance->bRebootHold);
            }
            pInstance->mutex->API->Unlock(pInstance->mutex);
        }
    }
}

bool RebootHandlerStart(void) {
    if (s_pWatchdog) {
        s_pWatchdog->OnRebootNotify(RebootHandler, NULL, NULL);
        return true;
    }
    else return false;
}

/********************************************************************************************************************************
 * Library initialization and finalization                                                                                     */

static bool Esp32DriverPinsImpl_LibInit(void) {
    DLOG("init", NULL);

    if (!(s_pWatchdog = lt_openlibrary(LTDeviceWatchdog))) return false;

    /* A new thread is needed to configure a pin at the reboot, but we should check if there
     * is a way to repurpose some other thread at the reboot time because we are shutting
     * down anyway. */
    if (!(s_hRebootThread = LT_GetCore()->CreateThread("esp32.pins.onreboot"))) {
        LTLOG_REDALERT("boot.thrd.err", "Failed to create reboot handler thread");
        lt_closelibrary(s_pWatchdog);
        return false;
    }
    s_iThread = lt_getlibraryinterface(ILTThread, LT_GetCore());
    s_iThread->SetStackSize(s_hRebootThread, REBOOT_THREAD_STACKSIZE);
    s_iThread->Start(s_hRebootThread, RebootHandlerStart, NULL);
    if (!ConfigureDeviceUnits()) return Shutdown(NULL);
    XclkStart();
    return true;
}

/* Library finalization or bailure: */
static void Esp32DriverPinsImpl_LibFini(void) { LTLOG_DEBUG("fini", NULL); Shutdown(NULL); }

define_LTLIBRARY_INTERFACE(ILTDriverPins)
    .GetBankNameFromUnitNumber = Esp32DriverPinsImpl_GetBankNameFromUnitNumber,
    .GetUnitNumberFromBankName = Esp32DriverPinsImpl_GetUnitNumberFromBankName,
    .GetBankTypeFromUnitNumber = Esp32DriverPinsImpl_GetBankTypeFromUnitNumber
LTLIBRARY_DEFINITION;

define_LTDEVICE_DRIVER_IMPLEMENTATION(LTDevicePins, Esp32DriverPins);

LTLIBRARY_EXPORT_INTERFACES(Esp32DriverPins, (ILTDriverPins) (ILTDriverPins_InputBank) (ILTDriverPins_OutputBank) (ILTDriverPins_BidirectionalBank))

/******************************************************************************
 *  LOG
 ******************************************************************************
 *  14-Nov-22   constantine created from Esp32DriverPins
 *  20-Apr-23   constantine converted to the new Device Config Arbolation hotness
 *  17-Aug-23   commodus    added reboot handler thread
 *  04-Dec-23   commodus    increased reboot handler thread stack to 768
 */
